case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                               |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     urbanMicroclimateFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         86400;

deltaT          3600;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

functions
{
    probes
    {   
        // Where to load it from
        libs            ("libsampling.so");

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl    timeStep;
        writeInterval   10;  

        // Fields to be probed
        fields          (T U w); 
        region air;

        probeLocations
        (
			(-269.0 19.0 5.0)
			(-269.0 19.0 5.2)
			(-269.0 19.0 5.4)
			(-269.0 19.0 5.6)
			(-269.0 19.0 5.8)
			(-269.0 19.0 6.0)
			(-269.0 19.0 6.2)
			(-269.0 19.0 6.4)
			(-269.0 19.0 6.6)
			(-269.0 19.0 6.8)
			(-269.0 19.0 7.0)
			(-263.0 252.0 5.0)
			(-263.0 252.0 5.2)
			(-263.0 252.0 5.4)
			(-263.0 252.0 5.6)
			(-263.0 252.0 5.8)
			(-263.0 252.0 6.0)
			(-263.0 252.0 6.2)
			(-263.0 252.0 6.4)
			(-263.0 252.0 6.6)
			(-263.0 252.0 6.8)
			(-263.0 252.0 7.0)
			(-83.0 30.0 5.0)
			(-83.0 30.0 5.2)
			(-83.0 30.0 5.4)
			(-83.0 30.0 5.6)
			(-83.0 30.0 5.8)
			(-83.0 30.0 6.0)
			(-83.0 30.0 6.2)
			(-83.0 30.0 6.4)
			(-83.0 30.0 6.6)
			(-83.0 30.0 6.8)
			(-83.0 30.0 7.0)
			(13.0 -150.0 5.0)
			(13.0 -150.0 5.2)
			(13.0 -150.0 5.4)
			(13.0 -150.0 5.6)
			(13.0 -150.0 5.8)
			(13.0 -150.0 6.0)
			(13.0 -150.0 6.2)
			(13.0 -150.0 6.4)
			(13.0 -150.0 6.6)
			(13.0 -150.0 6.8)
			(13.0 -150.0 7.0)
			(164.0 -137.0 28.0)
			(164.0 -137.0 28.2)
			(164.0 -137.0 28.4)
			(164.0 -137.0 28.6)
			(164.0 -137.0 28.8)
			(164.0 -137.0 29.0)
			(164.0 -137.0 29.2)
			(164.0 -137.0 29.4)
			(164.0 -137.0 29.6)
			(164.0 -137.0 29.8)
			(164.0 -137.0 30.0)
			(204.0 36.0 20.0)
			(204.0 36.0 20.2)
			(204.0 36.0 20.4)
			(204.0 36.0 20.6)
			(204.0 36.0 20.8)
			(204.0 36.0 21.0)
			(204.0 36.0 21.2)
			(204.0 36.0 21.4)
			(204.0 36.0 21.6)
			(204.0 36.0 21.8)
			(204.0 36.0 22.0)
			(222.0 -25.0 5.0)
			(222.0 -25.0 5.2)
			(222.0 -25.0 5.4)
			(222.0 -25.0 5.6)
			(222.0 -25.0 5.8)
			(222.0 -25.0 6.0)
			(222.0 -25.0 6.2)
			(222.0 -25.0 6.4)
			(222.0 -25.0 6.6)
			(222.0 -25.0 6.8)
			(222.0 -25.0 7.0)
			(320.0 60.0 20.0)
			(320.0 60.0 20.2)
			(320.0 60.0 20.4)
			(320.0 60.0 20.6)
			(320.0 60.0 20.8)
			(320.0 60.0 21.0)
			(320.0 60.0 21.2)
			(320.0 60.0 21.4)
			(320.0 60.0 21.6)
			(320.0 60.0 21.8)
			(320.0 60.0 22.0)

			
            //(100.595 86.3716 2.0)
            //(119.398 86.1579 2.0)
        );
    }    
}

//urbanMicroclimateFoam controls

initialSolidTimestepFactor	0.001666667;

minDeltaT       1E-6;

maxDeltaT       100;

minFluidIteration	0;
maxFluidIteration	1000;

pcEqnForm    pc-based; //'pc-based' or 'mixed' - default is 'pc-based'

/*blending true;
blendingCoeffs
{
    dampingThickness 60;
    alphaCoeffU 0.3;
    alphaCoeffT 0.1;
}*/

// ************************************************************************* //
