case/constant/IDN
(
(	0	0	)
(	3600	0	)
(	7200	0	)
(	10800	0	)
(	14400	0	)
(	18000	0	)
(	21600	0	)
(	25200	249	)
(	28800	0	)
(	32400	1	)
(	36000	80	)
(	39600	37	)
(	43200	15	)
(	46800	3	)
(	50400	158	)
(	54000	12	)
(	57600	14	)
(	61200	765	)
(	64800	659	)
(	68400	441	)
(	72000	0	)
(	75600	0	)
(	79200	0	)
(	82800	0	)
(	86400	0	)
)
