case/constant/sunPosVector
(							
(	0	(	-0.117609	0.761952	-0.636865	)	)
(	3600	(	0.13311	0.760691	-0.63532	)	)
(	7200	(	0.374784	0.723386	-0.57987	)	)
(	10800	(	0.590953	0.652531	-0.474318	)	)
(	14400	(	0.766854	0.553007	-0.325759	)	)
(	18000	(	0.890503	0.43155	-0.144116	)	)
(	21600	(	0.953158	0.296329	0.060656	)	)
(	25200	(	0.951085	0.156773	0.266195	)	)
(	28800	(	0.884232	0.022265	0.466518	)	)
(	32400	(	0.757107	-0.098097	0.645883	)	)
(	36000	(	0.578351	-0.19603	0.791885	)	)
(	39600	(	0.360151	-0.264912	0.89449	)	)
(	43200	(	0.117377	-0.300054	0.946673	)	)
(	46800	(	-0.133426	-0.299069	0.944857	)	)
(	50400	(	-0.375163	-0.26203	0.889153	)	)
(	54000	(	-0.591368	-0.191513	0.783331	)	)
(	57600	(	-0.767277	-0.092244	0.634648	)	)
(	61200	(	-0.890905	0.028957	0.453265	)	)
(	64800	(	-0.953823	0.16382	0.251764	)	)
(	68400	(	-0.951801	0.303166	0.046531	)	)
(	72000	(	-0.885093	0.437583	-0.15853	)	)
(	75600	(	-0.757766	0.55766	-0.338832	)	)
(	79200	(	-0.578761	0.655353	-0.485334	)	)
(	82800	(	-0.360284	0.723956	-0.588289	)	)
(	86400	(	-0.160284	0.923956	-0.688289	)	)
)							

