case/0/air/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 1.6;
Zref                 10.0;
zDir                 (0 0 1);
flowDir              (-1 0 0);
z0                   uniform 1.0;
zGround              uniform 0.0;
value                $internalField;

// ************************************************************************* //
