case/0/vegetation.bckp/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/vegetation";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 299;

boundaryField
{
    west
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    east
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    north
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    south
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    ground
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    top
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    buildings
    {
        type            mapped;
        field           T;
        setAverage      0;
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
    air_to_vegetation
    {
        type            mappedLeafTemperature;
        field           Tl; 
        setAverage      0;  
        average         0;
        interpolationScheme cell;
        value           uniform 299;
    }
}


// ************************************************************************* //
