case/system/buildings/setset.batch
cellSet FacadesRoofs new boxToCell (-386 -243 0)(332 259 29)
cellZoneSet FacadesRoofs new setToCellZone FacadesRoofs
